In [1]:
import pandas as pd

C:\Users\wq\AppData\Local\Temp\ipykernel_17128\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
pp = {'city' : ['Tripoli','Sydney','Tripoli','Rome','Rome', 'Tripoli', 'Rome', 'Sydney', 'Sydney'],
'rank': ['1st','2nd','1st','2nd','1st', '2nd', '1st', '2nd','1st'],
'score1' : [44,48,44,41,38,44,34,54,61],
'score2': [67,63,67,70,64,77,45,66,72],
}

df = pd.DataFrame(pp, columns=['city', 'rank',  'score1', 'score2'])
df

      city rank  score1  score2
0  Tripoli  1st      44      67
1   Sydney  2nd      48      63
2  Tripoli  1st      44      67
3     Rome  2nd      41      70
4     Rome  1st      38      64
5  Tripoli  2nd      44      77
6     Rome  1st      34      45
7   Sydney  2nd      54      66
8   Sydney  1st      61      72

In [6]:
# which rows are duplicated
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [7]:
df.duplicated(['rank'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
7     True
8     True
dtype: bool

In [14]:
# by default --> keep='first'
df.duplicated(['city'], keep='first')

0    False
1    False
2     True
3    False
4     True
5     True
6     True
7     True
8     True
dtype: bool

In [15]:
df.duplicated(['rank', 'city'])

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
8    False
dtype: bool

In [16]:
# drop duplicateds
df.drop_duplicates('city')

      city rank  score1  score2
0  Tripoli  1st      44      67
1   Sydney  2nd      48      63
3     Rome  2nd      41      70

In [ ]:
df.drop_d